{
  "id": "1b6932ed60b20872a03bebfe2a50f59d",
  "url": "https://gizmodo.com/did-a-neanderthal-spot-a-face-in-this-rock-43000-years-ago-and-leave-a-fingerprint-behind-2000607898",
  "title": "Did a Neanderthal Spot a Face in This Rock 43,000 Years Ago—and Leave a Fingerprint Behind?",
  "category": "tech",
  "authors": [
    "Ellyn Lapointe",
    "Margherita Bassi",
    "Natalia Mesa"
  ],
  "published": "2025-05-31T10:00:20+00:00",
  "fetched": "2025-05-31T13:22:22.771822+00:00",
  "text": "While digging inside a cave in the Spanish city of Segovia, archaeologists uncovered an unusual rock. The hand-sized stone naturally resembled an elongated face, and featured a spot of red pigment made from ochre right on the tip of what may be considered its nose.\n\n“We were all thinking the same thing and looking at each other because of its shape: we were all thinking, ‘This looks like a face,’” David Álvarez Alonso, an archaeologist at Complutense University in Madrid who was part of the dig, told The Guardian.\n\nÁlvarez Alonso and his colleagues spent the next three years studying this bizarre rock. The researchers posit that 43,000 years ago, a Neanderthal dipped their finger in ochre and pressed it onto the stone’s central ridge—leaving behind what is now considered to be the world’s oldest complete human fingerprint. It’s an intriguing finding that could have significant implications, but some experts would like to see more evidence to support this hypothesis.\n\nThe team published its findings in the journal Archaeological and Anthropological Sciences on Saturday, May 24. In the paper, the archaeologists state that the “strategic position” of the dot suggests it is evidence of Neanderthals’ “symbolic behavior.” In other words, it’s a piece of art that “could represent one of the earliest human face symbolizations in prehistory.”\n\n“The fact that the [rock] was selected because of its appearance and then marked with ochre shows that there was a human mind capable of symbolizing, imagining, idealizing and projecting his or her thoughts on an object,” the researchers write.\n\nWhether Neanderthals were capable of making art is a subject of ongoing debate, co-author María de Andrés-Herrero, a professor of prehistory at Complutense University, told the BBC. But over the past decade, a growing body of evidence has led many experts to believe that artistic expression emerged earlier in human evolution than previously thought.\n\nThe authors of this new study think their stone adds to this evidence. To reach this conclusion, they first needed more data to support the idea that this ancient artist had actually experienced pareidolia: seeing a face in an inanimate object. To that end, they generated a 3D model of the stone’s surface and measured the distances between its features, finding that the red dot—or nose—was placed such that it accurately resembled an actual nose on a human face.\n\nThen, the researchers enlisted the help of geologists to characterize the red dot, confirming that it was made with ochre. Forensic police experts then used multispectral analysis—a technique that can reveal details invisible to the naked eye—to confirm that the red dot had been applied with a fingertip. Their analysis uncovered a fingerprint that could have belonged to an adult male Neanderthal inside the dot.\n\n“Once we had that and all the other pieces, context and information, we advanced the theory that this could be a pareidolia, which then led to a human intervention in the form of the red dot,” Álvarez Alonso told The Guardian. “Without that red dot, you can’t make any claims about the object.”\n\nBut Gilliane Monnier, a professor of anthropology at the University of Minnesota who studies Neanderthal behavior, is not totally convinced by the researchers’ findings.\n\n“The fact that there are these natural depressions—and that we can measure the distance between them and argue that it’s a face—that’s all well and good,” Monnier, who wasn’t involved in the study, told Gizmodo. “But that doesn’t give us any indication that the Neanderthals who [occupied this cave] saw a face in that [rock].”\n\nWhat’s more, she is skeptical of the researchers’ claim that the red dot was actually made with a human fingertip. It’s possible, she said, that the coloring and fingerprint-like ridges formed naturally.\n\n“I would be interested in seeing an explanation by a geologist—someone trained in geology—saying the likelihood of this forming by natural, geological or geomicrobial processes is a very low likelihood,” Monnier said.\n\nThe researchers, too, acknowledge that “it is unlikely that all doubts surrounding this hypothesis can be fully dispelled,” and state that the pareidolia hypothesis should not be seen as a definitive claim, but rather a possible explanation for this object based on the evidence.\n\nSo it’s hard to say whether this study clarifies or complicates our understanding of how the human mind evolved the ability to create art. The face-shaped rock is an intriguing piece of the puzzle, but more research is needed to figure out where it fits."
}