{
  "category": "drones",
  "id": "1c8e0e14b5352feec6f63d59e9a5e03c",
  "url": "https://www.suasnews.com/2025/05/pilot-requirements-for-uncrewed-aircraft-covered-in-new-astm-white-paper/",
  "title": "Pilot Requirements for Uncrewed Aircraft Covered in New ASTM White Paper",
  "text": "Rewritten: Pilot Requirements for Uncrewed Aircraft Covered in New ASTM White Paper\n\nThe new paper covers how automated systems can meet regulations’ safety intent.\n\nW. CONSHOHOCKEN, Pa., May, 2025 — ASTM International’s autonomy design and operations in aviation administrative committee (AC377) has published a new white paper entitled, “A Safety Intent-Based Application of Part 23 “Pilot” and “Flightcrew” Requirements for Uncrewed Aircraft.”\n\nAs automation becomes more prevalent in aircraft design, development, and certification, understanding regulatory language is essential for demonstrating compliance with existing airworthiness standards. This new white paper outlines how designers of highly automated, remotely piloted, optionally piloted, and uncrewed aircraft can meet the safety intent of current regulations. With its focus on the aircraft’s intrinsic characteristics and system performance, this guidance is particularly relevant for regulations referencing a “pilot” or “flightcrew”.\n\n“This paper adds to the excellent lineup of industry-driven, collaborative publications from the AC377 team addressing topics for the practical implementation of greater automation towards future autonomy,” said Wes Ryan, Northrop Grumman NG Fellow for Airworthiness of Autonomy and AI, and chair of AC377. “We hope it helps readers better understand the safety intent behind regulations containing expectations of pilots and flight crew, and how those expectations can be met by automation.”\n\nThis white paper emphasizes that airworthiness standards can be satisfied regardless of where or how functions are performed. The aircraft must consistently demonstrate safe, predictable performance, whether by a human or by automated systems. This approach supports compliance with regulations such as 14 CFR Part 21 and its associated standards, while setting the stage for future integration of increasingly autonomous systems.\n\nAccess the white paper here: https://www.astm.org/about/white-papers\n\nAbout ASTM International\n\nAdvancing standards and transforming markets, we touch every part of everyday life – helping our world work better.\n\nOver 12,000 ASTM standards operate globally. Defined and set by us, they improve the lives of millions every day. Combined with our innovative business services, they enhance performance and help everyone have confidence in the things they buy and use.\n\nRelated",
  "authors": [],
  "published": "2025-05-27T19:34:02+00:00",
  "fetched": "2025-05-29T23:15:57.169460+00:00"
}