{
  "id": "1d89ec8eeac878b12b53c4ebf0a545a5",
  "url": "https://www.theverge.com/tech/675646/peacock-premium-poker-face-wicked-conclave-deal-sale",
  "title": "This is your last week to get a year of Peacock Premium for just $24.99",
  "category": "tech",
  "authors": [
    "Sheena Vasani"
  ],
  "published": "2025-05-28T16:20:00+00:00",
  "fetched": "2025-05-30T12:54:05.827986+00:00",
  "text": "Peacock may fly under the radar compared to other streaming services like Netflix, but it offers a surprisingly strong library that includes shows like Poker Face and films like Wicked for less money. And now, new and returning subscribers can get a full year of ad-supported Peacock Premium for just $24.99 ($55 off) when they use promo code SPRINGSAVINGS at checkout through May 30th, making it an even better value.\n\nWhether you’re into drama, comedy, or thrillers, Peacock’s catalog features an extensive collection of movies and shows. That includes recent box office hits from the past few years, such as The Wild Robot, Conclave, Twisters, and Oppenheimer, all of which you can stream on multiple devices.\n\nThe platform also offers a diverse lineup of shows, from Yellowstone and the upcoming horror series Teacup to Saturday Night Live and the forthcoming The Office spinoff, The Paper. Viewers can also catch next-day NBC and Bravo episodes, and even stream live sports events such as NBA games, golf tournaments, and even WWE wrestling – so you’ll have more than enough entertainment to keep you busy this summer.\n\nJust remember, though: after the promo period ends, the subscription will automatically renew at the full price of $79.99 per year. To avoid charges, make sure to cancel before then – or simply turn off auto-renew now to save yourself the hassle later.\n\nVerge Deals Sign up for Verge Deals to get deals on products we’ve tested sent to your inbox weekly. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
}