{
  "category": "drones",
  "id": "2d64c6ae8c5152af8afc1375a7c0d008",
  "url": "https://www.suasnews.com/2025/05/keynote-remarks-made-by-auvsi-president-and-ceo-michael-robbins-at-xponential-2025-on-may-20-2025/",
  "title": "Keynote remarks made by AUVSI President and CEO Michael Robbins at XPONENTIAL 2025 on May 20, 2025 – sUAS News",
  "text": "Rewritten: Keynote remarks made by AUVSI President and CEO Michael Robbins at XPONENTIAL 2025 on May 20, 2025\n\nGood morning, everyone. It is great to be here with all of you in Houston in the great state of Texas, a state leading the way in the deployment of uncrewed and autonomous vehicles. Thank you for joining us as XPONENTIAL, the world’s leading event for the autonomy industry that AUVSI is thrilled to deliver to you with our partners at Messe Düsseldorf North America.\n\nAcross this room and the XPO hall are 7,000 opportunities to connect with industry peers.\n\nWe’re thrilled to have you with us and know it will be a great week for you, your teams, and your customers\n\nAs I begin my second year leading AUVSI, I’m excited to share what’s ahead.\n\nBut first, I want to recognize the incredible AUVSI team – dedicated, mission-driven professionals on staff, along with our tremendous Board of Directors, chapter leaders, Advocacy committee leaders, XPO programming committee and other volunteers.\n\nThank you all for the work you do every day to advance this industry. It’s an honor to be part of this team.\n\nLast year, in San Diego, I talked about how my charge to the AUVSI team is to find points of friction and move to them to solve problems for our members and the industry.\n\nAnd if you’ve interacted with the AUVSI team over the past year, you’ve probably heard that phrase – moving to points of friction – more than once. It’s because it drives everything we do.\n\nEvery advancement in this industry has required hard conversations, grit, and a commitment to collaboration. Brick by brick, together, we are building this industry.\n\nWe don’t retreat when challenges arise; we face them head-on.\n\nToday, I want to talk about some of the challenges our industry faces, and the opportunities that come along with those challenges – and more importantly, how AUVSI is leading the way to shape the future.\n\nAs all of you know, we are operating in an environment of uncertainty and instability. Navigating shifting tariffs, bureaucratic regulatory delays, DOGE, and constrained capital markets – it is requiring a lot from all of us.\n\nIn response, AUVSI has been sharing more real time and actionable intelligence with our members than at any time in our 53-year history – this unique moment has required more of us, where the strength of our team and transparency in our communication have been critical.\n\nUnderstanding the capital constraints many of you face, we are also committed to better connect our members with the investment community and educate investors community about the opportunities that exist within this industry.\n\nAUVSI is launching a new industry intelligence effort to help bridge the gap between our industry and the capital community. We have also invited the investment community into XPO, and there are a number of VCs here this week, taking part in panels and walking the show floor to see your technology on display.\n\nThat same commitment to our members is front and center as we engage with the new Congress and the Trump Administration, ensuring your priorities are reflected in recent Executive Orders and legislation. Rapid-fire executive orders, a very active Congress, and a busy spring session at the state level where we’ve been putting numbers on the boards with our Drone and AAM Prepared model legislations. We are also working closely with the White House, DOT, and the FAA on enabling regulations.\n\nAUVSI wrote the roadmap to autonomy, and now we are hard at work executing to bring the plan to reality.\n\nTo fully unlock the benefits of autonomy, policy momentum must be matched by technical progress and regulatory modernization. Aircraft certification processes must be streamlined and industry expertise leveraged, and air traffic control technologies must be modernized to utilize new software-defined tools to supplement and augment the FAA workforce and make radar data available to more users. Universal electronic conspicuity for legacy aircraft must be a national priority to improve airspace safety and help enable more autonomous operations.\n\nBVLOS is critical to unlocking the full potential of the drone industry, and while waivers and exemptions are being issued, getting to an operational BVLOS rule has felt a bit like Sisyphus eternally pushing the rock up the hill.\n\nWe are going get there, but it is going to require more hard work. More grit.\n\nIt was great to see the FAA and DOT move the draft rule to the White House Office of Management and Budget last week, where it’ll undergo review. Again. The long awaited 2209 rule – well, it appears we are waiting a little longer, but again, good to see the draft rule move forward with BVLOS last week to OMB.\n\nLike with the two draft rules moving to the OMB together, increasingly, drone security and enabling regulations are being closely tied together. Accordingly, UAS Detection and Mitigation authorities must be updated and expanded. The last update was in 2018 – an unacceptable timeframe for a rapidly transforming landscape.\n\nRemote ID compliance is below 50%. Houston, we have a problem. Clearly, some things need to change.\n\nAUVSI is engaged on each of these key issues shaping outcomes that will strengthen our industry. But again, there is a lot of work ahead. The environment is challenging. And we need you with us.\n\nYou will hear more about these key challenges and opportunities right here tomorrow morning from FAA acting Administrator Chris Rocheleau. And we will continue this conversation directly with policymakers and regulators at the Drone & AAM Policy Symposium in July in Washington, DC at Nationals Park. It’ll be great fun.\n\nAUVSI continues to push the DOT & FAA, DHS, Congress, and the broader Administration to deliver the policies and frameworks that will allow safe, scalable operations to take root in all domains – air, ground, and maritime. And we are hard at work working with the White House on additional executive actions related to enabling regulations for drone operations, expanding counter UAS authorities, and reindustrializing the supply chain.\n\nWithout regulatory progress, innovation is being unnecessarily slowed down as other nations race ahead. With regulatory progress, we will unlock enormous economic, societal, and public safety benefits.\n\nAs you know, uncrewed systems are saving lives today. I was honored to tell that story to Congress last year before two different Congressional committees, building trust in our industry. And shout out to our friend Sgt. Dooley with Florida Highway Patrol who is testifying before the U.S. Senate right now to help build trust. He’s flying here tonight to be at XPO tomorrow, so be sure to give him some love when you see him.\n\nThese opportunities are so important because without clear communication and consistent performance, trust can be fragile. Last December, the media and social media environment helpfully reminded us of that when “drones” over New Jersey became a top trending story. The frenzy not only exposed the gaps in our nation’s low altitude airspace awareness but also showcased that public trust can evaporate quickly in the face of a crisis – real, imagined, misidentified, or contrived.\n\nThat’s why AUVSI, and our partners like Dr. Will Austin at Warren County Community College in New Jersey, are hard at work elevating the stories of responsible, safe, forward-leaning operators. We are leading conversations with communities, policymakers, and the public to show how this technology enhances, rather than threatens, their daily lives.\n\nWe are also telling the story of job opportunity and growing the future workforce. This is also essential for public trust, as some people mistakenly assume more autonomy equals less jobs. Not true. In fact, autonomous systems boost productivity, open new industries, and allow workers to focus on higher-value, more rewarding tasks instead of repetitive or dangerous ones.\n\nAUVSI is also a firm believer that a well-trained workforce is required to build and maintain the public’s trust. That is why we have long overseen the drone pilot training program, Trusted Operator, and this year launched our training effort with maritime operators.\n\nTo stay ahead, we must pair public trust with readiness – ensuring the workforce is not only informed but equipped to lead in this new era of autonomy. Let there be no doubt, we are in a new era.\n\nThe robotics race is underway, and America cannot afford to fall behind. The United States stands at a pivotal moment where leadership in advanced robotics, autonomy, and embodied AI will define our economic strength, national security, and global competitiveness. That is why AUVSI will lead the effort to forge a bold national robotics strategy – uniting government, industry, academia, investors, and innovators to ensure the United States wins the fight for economic leadership, technological dominance, and national security.\n\nWe will be launching our campaign on this front soon, and we are excited to have many of you at the table with us already, forging this plan for action.\n\nAnother major issue facing our industry today: supply chain resiliency. The People’s Republic of China’s restrictions on rare earth elements are impacting every segment of the U.S. technology industry, and targeted sanctions on U.S. drone and autonomy companies should be a wake-up call for everyone in this room. These aren’t just geopolitical headlines – they have direct consequences on our ability to build and scale the uncrewed systems our economy and national security depend on.\n\nSome of you may choose not to hear this. But it needs to be said. Too many in this industry are staying silent, turning a blind eye, or – more troubling – aligning with technologies developed by our adversaries rather than supporting innovation within democratic nations.\n\nTo those making that choice, understand that the industry is moving on. The future belongs to those who stand for responsible innovation, strategic alignment, and national security. Those who do not will find themselves increasingly irrelevant. There is no ambiguity here. Relying on adversarial nations for critical resources and technologies is not just short-sighted, it is dangerous. Dangerous both to national security and to your organizations.\n\nThe PRC routinely uses economic tactics to undermine U.S. industry and that of our allies, from flooding markets with subsidized products to sanctioning U.S. companies and stealing intellectual property. Halting rare earth exports is the latest move, threatening U.S. economic stability, defense readiness, and critical sectors like aerospace and autonomy.\n\nAt AUVSI, we’re not just raising alarms. We’re offering solutions. We’ve launched working groups focused on battery standardization and other key components – including one here at XPO. We are hosting industry roundtables with the DoD on industrial base capacity focused on motors, batteries, and supply chain resiliency. We’re building out critical resources like our Uncrewed Systems & Robotics Database to track components and help identify vulnerabilities before they become crises.\n\nWe are working every day to ensure that American manufacturers, and those of our allies, can access the materials and components they need without relying on adversarial sources. The challenge isn’t just about parts – it’s about production. We must make intentional investments and execute upon a broader industrial policy agenda to ensure that we can build, and build at scale.\n\nAmerica needs to reindustrialize and expand its industrial base. We need to expand manufacturing, but in new ways that play to our strengths, instead of simply trying to bring back old ways, or replicating what other nations are doing.\n\nAnd industry needs production incentives to spur that reindustrialization and supply constraints for those cheating the rules. We must end bureaucratic gridlocks to enabling regulations to allow the industry to grow and scale. We need to invest in the future workforce. We must enhance partnerships with allied nations that can offer more resilient and secure supply chains and help us collectively scale production.\n\nAUVSI and our members are working with the White House and Congress to leverage industrial policy tools like the Defense Production Act, advanced market commitments, manufacturing tax incentives, permitting reform, and enhancing global partnerships. This is a meaningful industrial policy agenda. All of this is possible and within reach.\n\nWhile strengthening domestic and allied production capabilities is essential to countering the economic aggression being exerted by our adversaries and winning the future, it’s only one battlefield.\n\nAs we have repeatedly emphasized, we are seeing greater persistence and sophisticated cyber threats to our critical infrastructure, telecommunications and our transportation systems. Solar Winds. Volt Typhoon. Salt Typhoon. Backdoors intentionally programmed into software and rogue communication devices in hardware. That threat has not gone away. In fact, it has grown. Therefore, cybersecurity remains a key focus of our work.\n\nThat’s why AUVSI continues to drive Green UAS and work with DIU on reforms to Blue UAS to ensure trusted, secure technology is at the center of both our defense and commercial ecosystems. That is why we are launching our Trusted UGV program for cybersecurity and supply chain transparency here at XPONENTIAL.\n\nAt XPO ‘24 last year, we announced a partnership with DIU to share information between Blue and Green UAS frameworks. I’m proud to report that this collaboration has already led to two drones transitioning from Green to Blue and six from Blue to Green. We’ve added dozens of components to the approved frameworks, giving both industry and government more trusted options.\n\nHave there been challenges? Absolutely. We have listened to industry concerns, and we are working with DIU and our members to create a system that is more agile, more transparent, and more user-friendly.\n\nDIU announced last Friday that Green UAS will be used for compliance for Blue UAS Cleared. This step is a major validation of our shared work to accelerate access to secure, compliant uncrewed systems and solve problems for our industry and the warfighters we serve. DIU will talk more about those coming reforms tomorrow right here on this stage and in a follow-on session on Thursday.\n\n\n\nAnd let’s not lose sight of the bigger challenge: last year, DoD bought less than 4,000 drones across the entire department. That is not a Blue UAS problem. That is a budget problem. And it’s one AUVSI is working to fix by pushing for stronger budget commitments, more agile acquisition, and a greater emphasis on uncrewed systems and robotics across defense planning.\n\nThis is personal for all of us at AUVSI. Robots don’t bleed. Every secure autonomous system we put into the field reduces risk to human life and extends our operational reach. And we know the warfighter wants more of what you are producing across the air, ground, and maritime domains. Tomorrow you’ll hear from MG Link from Army Future’s Command, and on Thursday, you’ll hear from LTG Donovan, the Vice Commander of U.S. Special Operations Command.\n\nI don’t know specifically what he’ll say, but I have heard GEN Fenton, the Commander of SOCOM, talk about what he wants – the 4 A’s: Autonomous, Attritable, Affordable, A-Plenty. I love that. To meet this demand from the warfighter, we must be faster and smarter about how we move forward.\n\nThe reality is: Acquisition reform remains elusive with no clear correction in sight. Accordingly, AUVSI is advocating for efforts to prioritize alternative pathways to acquisition that can serve as a workaround, rather than trying to fix a system that is beyond repair. This isn’t our idea, or even a new idea, but it is gaining new momentum – including from a White House executive order – after some very tangible successes utilizing Commercial Solutions Offerings, Other Transaction Authorities, and other non-traditional acquisition pathways.\n\nAUVSI is also leading efforts to reform the Foreign Military Sales process, helping secure language in a new Executive Order that revisits outdated rules treating drones as missiles—rules that have long hindered exports.\n\nWe’re helping shape the future of U.S. maritime power by making sure autonomous vessels are part of the conversation—both through the Trump Maritime Dominance EO and in shaping the SHIPS for America Act now moving on Capitol Hill.\n\nFurthermore, it also comes down to dollars. As I said, the DoD is not buying nearly enough autonomous systems. 4,000 drones last year. 300 autonomous small boats this year. Almost nothing in the ground domain yet. These are not impressive numbers.\n\nAs a result, warfighters have only limited access to the tools, which results in a dearth of training and familiarity, which means if the ballon goes up tonight, we are not as ready as we should be. This is extremely challenging and quite dire.\n\nCongress isn’t helping – they didn’t pass any appropriations bills for FY25, which means the DoD and the broader USG is operating by Continuing Resolution. This is not good government, but we are trying to make the best of a bad situation by working with Congressional committees to redirect funds towards autonomous systems in the budget reconciliation bill.\n\nAUVSI has successfully advocated for billions in the reconciliation package to build the uncrewed industrial base, with game changing investments in autonomous air, counter UAS, and maritime systems. We have also set the foundation for significant increases in autonomous system spending in FY26 defense budget. Further, the Marine Corp’s Attack Drone team, the Navy’s addition of a new robotic ship squadron, the Air Force’s Combat Airpower for All Airmen program, and the $36 billion Army Transformation Initiative are all direct recognitions of the need to disrupt the status quo and take lessons from the battlefield in Ukraine and apply them to the future of U.S. warfighting.\n\nWe cannot allow adversaries to outpace us simply because we failed to buy, plan, train, and execute. In just a few minutes, you’ll hear from Dr. Rush Doshi and Sue Gordon, two of the foremost minds on the national security landscape. They’ll dig deeper into the threats we face and the strategies we need to counter them. There are clear opportunities for those of you wise enough to heed their advice.\n\nAs my friend Rush has outlined, authoritarian rivals like China & Russia are executing coordinated plans to build “Arsenals of Autocracy.”\n\nThey are using technology, supply chains, and cyber operations to extend their influence and undermine free societies. We must respond with equal determination. We must align with partners and democratic allies.\n\nAUVSI has been leading the way, advocating for our industry’s priorities in AUKUS and working to build upon that model with other nations. Furthermore, we are delighted to have extended the XPONENTIAL brand to Europe – launching XPO EU this past February in Germany with our partners at Messe Dusseldorf.\n\nWe are honored to be hosting the U.S. Taiwan Autonomous Systems Cooperation Forum, which takes place here today at the AUVSI Defense stage. We are proud to have international pavilions on the show floor from Germany, Korea, Spain, and Taiwan and to have our friends from the Africa Drone Forum and the Armed Forces of Ukraine here with us. Our democratic allies and partners are essential to building scale, resilience, and a shared technological advantage.\n\nIf our rivals can coordinate to undermine democracy, we must coordinate to defend it. Together, we must build an industrial and operational base that spans the American system and of our trusted allies – an Uncrewed Arsenal for Democracies.\n\nAt AUVSI, we are not waiting for others to define the future. We are helping to build it. Moving to points of friction to solve problems. And progress is only possible because of the leaders who dedicate their time, energy, and expertise, stepping forward to carry the mission even further.\n\nToday, marks an important transition, one that honors the service of our outgoing Chair of our Board of Directors and welcomes the vision of our new Chair. Please join me in welcoming both Bill Irby and JC Coffey to the stage.\n\nBill – thank you for your tireless leadership and deep commitment to this community. You’ve helped AUVSI grow stronger, more resilient, and more future-focused. We are grateful. JC – your passion and perspective will be critical as we take on what’s next. We’re excited to have your leadership and the steady energy you bring to every conversation, every challenge, and every opportunity.\n\nToday it is my pleasure to introduce National Security Leader and the Former Principal Deputy Director of National Intelligence, Sue Gordon. Gordon was the country’s number two ranking intelligence official who oversaw the innovation and transformation of the entire intelligence community. Having led at every level of the intelligence community and across various organizations and disciplines, she has learned to “see the world as it is, not as she prefers it to be.”\n\nJoining Sue onstage is Dr. Rush Doshi, the C.V. Starr Senior Fellow for Asia Studies and Director of the China Strategy Initiative, Council on Foreign Relations and a professor at Georgetown University. Rush is the author of The Long Game, China’s Grand Strategy to Displace the United States. He is also a friend.\n\nI urge you to listen closely to the conversation – as their aim is to highlight threats but also uncover opportunities for this community.\n\nRelated",
  "authors": [
    "Founder",
    "Editor Of Suas News",
    "Gary Mortimer Has Been A Commercial Balloon Pilot For Years",
    "Also Flies Full-Size Helicopters. Prior To That",
    "He Made Tea",
    "Coffee In Air Traffic Control Towers Across The Uk As A Member Of The Royal Air Force."
  ],
  "published": "2025-05-28T14:31:48+00:00",
  "fetched": "2025-05-29T23:15:54.655269+00:00"
}