{
  "id": "2dcde64e387b178ec4932230b58c6a08",
  "url": "https://arstechnica.com/gadgets/2025/05/amazon-fire-sticks-enable-billions-of-dollars-worth-of-streaming-piracy/",
  "title": "Amazon Fire Sticks enable “billions of dollars” worth of streaming piracy",
  "category": "tech",
  "authors": [],
  "published": "2025-05-30T21:18:44+00:00",
  "fetched": "2025-05-31T13:22:30.403215+00:00",
  "text": "Amazon Fire Sticks are enabling “billions of dollars” worth of streaming piracy, according to a report today from Enders Analysis, a media, entertainment, and telecommunications research firm. Technologies from other media conglomerates, Microsoft, Google, and Facebook, are also enabling what the report’s authors deem an “industrial scale of theft.\"\n\nThe report, \"Video piracy: Big tech is clearly unwilling to address the problem,\" focuses on the European market but highlights the global growth of piracy of streaming services as they increasingly acquire rights to live programs, like sporting events.\n\nPer the BBC, the report points to the availability of multiple, simultaneous illegal streams for big events that draw tens of thousands of pirate viewers.\n\nEnders' report places some blame on Facebook for showing advertisements for access to illegal streams, as well as Google and Microsoft for the alleged “continued depreciation” of their digital rights management (DRM) systems, Widevine and PlayReady, respectively. Ars Technica reached out to Facebook, Google, and Microsoft for comment but didn’t receive a response before publication.\n\nThe report echoes complaints shared throughout the industry, including by the world’s largest European soccer streamer, DAZN. Streaming piracy is “almost a crisis for the sports rights industry,” DAZN’s head of global rights, Tom Burrows, said at The Financial Times’ Business of Football Summit in February. At the same event, Nick Herm, COO of Comcast-owned European telecommunication firm Sky Group, estimated that piracy was costing his company “hundreds of millions of dollars” in revenue. At the time, Enders co-founder Claire Enders said that the pirating of sporting events accounts for “about 50 percent of most markets.”\n\nJailbroken Fire Sticks\n\nFriday's Enders report named Fire Sticks as a significant contributor to streaming piracy, calling the hardware a “piracy enabler.”\n\nEnders’ report pointed to security risks that pirate viewers face, including providing credit card information and email addresses to unknown entities, which can make people vulnerable to phishing and malware. However, reports of phishing and malware stemming from streaming piracy, which occurs through various methods besides a Fire TV Stick, seem to be rather limited."
}