{
  "id": "5b93a39f9ea9121f3387ad0b69c3ab60",
  "url": "https://gizmodo.com/oppo-find-x8-ultra-review-this-might-be-the-worlds-best-phone-camera-2000609598",
  "title": "Oppo Find X8 Ultra Review: This Might Be the World’s Best Phone Camera",
  "category": "tech",
  "authors": [
    "Sam Byford",
    "Matt Novak",
    "James Pero",
    "Kyle Barr"
  ],
  "published": "2025-06-01T13:00:05+00:00",
  "fetched": "2025-06-01T16:52:17.876649+00:00",
  "text": "2025\n\nI get it—the smartphone market is boring. Galaxy after iPhone after Pixel, year after year after year—at least if you’re in the U.S. Even if you’re into phone tech, it can be hard to feel enthusiastic about the prospect of annual upgrades.\n\nIn Asia, however, the battle for smartphone supremacy is as brutal as ever. Chinese companies like Huawei, Vivo, and Xiaomi are still locked into breakneck competition, releasing multiple devices a year that put Western offerings to shame—at least on paper. The Oppo Find X8 Ultra is one of the strongest recent examples. It’s an all-around flagship phone that crams the very best of high-end specs into a sleek form factor. All things considered, I think it’s the best camera phone available anywhere in the world.\n\nOppo Find X8 Ultra Oppo’s latest flagship Find X8 Ultra has everything you could possibly want from a phone—except availability outside of China. Pros Unbeatable specs\n\nUnbeatable specs Versatile camera system\n\nVersatile camera system Best-in-class image processing Cons Mediocre ultra-wide lens\n\nMediocre ultra-wide lens Only available in China\n\nIt’s not exactly a Samsung Galaxy S25 Edge, but Oppo’s stated goal with the Find X8 Ultra’s design was to pull off “the thinnest camera phone.” At 8.78mm thick compared to its 9.5mm-thick predecessor, the Find X7 Ultra, Oppo has indeed slimmed the Find X8 Ultra down beyond any of its cutting-edge competitors. But because of its boxy, squared-off design, it doesn’t necessarily seem that much thinner in the hand. This year’s Xiaomi 15 Ultra, for example, is 9.48mm thick but has tapered edges that don’t dig into your palms as much.\n\nThat’s not to say the Find X8 Ultra is unwieldy. Oppo has basically achieved what it set out to here; it essentially feels like a very slightly thicker iPhone 16 Pro Max, which is a strong achievement considering the hardware. But the design is extremely straightforward and austere, which may or may not be to your taste. Oddly, the Find X8 Ultra looks near-identical to the base Find X8, while the mid-tier Find X8 Pro is sleeker and flashier than both.\n\nThe display is as good as you’ll find on any premium phone. It’s a 6.82-inch flat-sided OLED panel with a variable refresh rate (1 to 120Hz) and 1440p resolution. The Find X8 Ultra gets up to 1,600 nits bright in regular outdoor usage and peaks at 2,500 nits with HDR content. The bezels are equally slim on all four sides. It has Dolby Vision support and, more unusually, Oppo’s Splash Touch technology to limit unwanted inputs when it’s wet. I did make a point of testing this in a hot tub, for science, and the phone really does actually stay more or less usable even when it’s covered in drops of water.\n\nI’ll also mention the ultrasonic fingerprint sensor, not just for its speed improvements over the X7 Ultra’s optical reader, but for how Oppo improved the way you set it up—now you can register your thumb by just rolling it in a circle a few times rather than tapping the sensor repeatedly with every part of the tip. Not the biggest deal in the world, but a welcome improvement if you’re a weirdo like me who goes through that process dozens of times a year when testing new phones.\n\nAnother design quirk is Oppo’s shift away from a mute slider switch, a popular differentiating feature on phones from its subsidiary OnePlus. There’s now a customizable button on the top left of the phone called the Shortcut Button, and yes, it works more or less identically to the iPhone’s Action Button—right down to the full-screen UI that pops up when you choose its function. I’m fine with the hardware change, but the implementation is a little brazen.\n\nElsewhere, the Find X8 Ultra’s spec sheet includes what you’d expect from the top shelf of Android flagships in 2025. The processor is a Qualcomm Snapdragon 8 Elite and the phone can be outfitted with up to 16GB of RAM and 1TB of storage. (The base model has 12GB and 256GB, respectively.)\n\nThis is Oppo’s first Ultra-class phone to include silicon-carbon battery technology, following its debut in the X8 Pro and a subsequent appearance in the folding Find N3. Basically, this allows Oppo to get a lot more capacity out of a smaller physical space—despite its slimmer frame, the Find X8 Ultra’s battery weighs in at 6,100mAh versus 5,000mAh on the X7 Ultra. As for charging, Oppo’s own 100W SuperVOOC adapter can get you from zero to 100 percent in under 40 minutes, which is impressive considering the increased capacity of the battery. The Find X8 Ultra also supports wireless charging at up to 50W with a compatible proprietary charger. Between the fast charging and the large battery capacity, I’ve found the phone unlikely to die on me in regular use. I’m not going to say it’ll never happen on a long day of shooting in the sun, but it’s been as solid as any comparable phone I could name.\n\nThat brings me to the camera system, which—as ever with “Ultra”-class Chinese flagships—is the main point of differentiation here. The Find X8 Ultra doesn’t necessarily have the best hardware in every single category, but there’s a strong case to be made that it’s the most well-rounded and versatile camera system around.\n\nThe Find X8 Ultra’s primary camera uses a 1-inch-type sensor, which is the class-leading standard for Chinese flagship phones; it’s the same size as what you’ll find on Sony’s RX100 range of point-and-shoot cameras or Fujifilm’s new X half. What this means in practice is that the lens you use the most gives you far more depth and dynamic range than what you get from an iPhone or Galaxy. The light-gathering ability is simply on another level, and you’re able to separate subjects through shallow bokeh (background blur) without resorting to portrait mode, which often still shows imperfections between the foreground and background.\n\nThe Find X8 Ultra’s telephoto lenses—yes, there are two—are also a particular strength. The 3x periscope camera has an unusually large 1/1.56-inch sensor paired to an f/2.1 lens with close-focus ability, allowing for excellent mid-range and macro shots with natural shallow depth of field. There’s also a 6x f/3.1 lens with a 1/1.95-inch sensor. The one drawback is the 1/2.75-inch ultra-wide camera, which isn’t necessarily weak next to the competition but does feel like a compromise in the name of thinness; previous Oppo flagships performed much better.\n\nOppo has also adopted a thoughtful approach to camera software. The regular photo mode turns out pictures along the lines of what you’d expect from a high-end smartphone, with crunchy sharpness and HDR detail preserved in every shot. I think Oppo has the best color science in that sense, which is why phones like the Find N3 can outperform their hardware. But if you’re not into the typical smartphone photo look—which I personally am not—you can swipe on over to the Hasselblad-branded Master mode, which gives you much more natural results right out of the box. While Master mode is fully customizable, its default settings tend to line up with what I’d be aiming for when editing files from a dedicated camera.\n\nThis year, Oppo’s image processing is aided by what the company calls a “True Chroma Camera,” a low-res sensor dedicated to capturing accurate color information across the frame for better automatic white balance. It’s difficult to test exactly how the camera system would work without this additional hardware, but I did see impressive results in challenging situations like low-light portraits.\n\nThe shooting experience is also helped by the “Quick Button,” which is pretty much a facsimile for Apple’s Camera Control. It gives quick access to the camera app and shutter release, but it’s fully capacitive and much easier to press; I found myself using it a lot more often than I do on my own iPhone 16 Pro.\n\nThe Find X8 Ultra has a vastly more capable camera system than you can get on any smartphone sold in the US, and it trades blows with the best available from domestic competitors like Xiaomi and Vivo. That said, I can’t really recommend anyone go out of their way to buy it unless they’re based in China. I have personally found it to work well on my NTT Docomo SIM card in Japan, but I can’t speak to bands or coverage wherever you might be reading this.\n\nOppo’s China-focused version of ColorOS is pretty usable and comes with built-in compatibility for Google Mobile Services through a settings toggle, meaning you can use the Play Store and Google apps along with any third-party software that relies on Google’s APIs. Still, an uninitiated Western user might feel blindsided by a bunch of Chinese bloatware and services they won’t ever be able to use. The Find X8 Ultra’s eSIM support is only accessible through the built-in ORoaming app, for example, and you can only pay for data through WeChat or AliPay.\n\nBut the bigger picture here is that the Find X8 Ultra demonstrates how Chinese phone makers are simply miles ahead of what’s available in the U.S. and Europe. Whether you’re shopping for a Galaxy, Pixel, or iPhone this year, you’re getting a raw deal when it comes to pure hardware capability and camera performance. This phone launched at 6,499 yuan in China, which works out to around $900.\n\nGiven the present political climate, it seems less likely than ever that Chinese OEMs will find a way to sell their highest-end devices in the U.S. That’s unfortunate for anyone interested in the best hardware available. The Oppo Find X8 Ultra will be my go-to camera phone until something better comes along, and I have a feeling that that something won’t be available in the U.S. either. It’s not like this particular phone necessarily changes the game—Chinese companies have been leapfrogging Apple and Samsung for years.\n\nAll in all, the Find X8 Ultra is an awesome phone that’s as good an example as any of what’s capable today with modern mobile technology. I think it’s clearly better than anything Apple, Samsung, or Google are selling in the U.S. today. Does that mean you should import it? Probably not. But it does mean you should raise your standards for the next time those companies try to sell you on new hardware."
}