{
  "id": "5bc447afcecf987fa7ec6a786cfd2262",
  "url": "https://gizmodo.com/gen-v-enrolls-for-season-2-in-september-2000609823",
  "title": "‘Gen V’ Enrolls for Season 2 in September",
  "category": "tech",
  "authors": [
    "Justin Carter",
    "James Whitbrook",
    "Cheryl Eddy",
    "Germain Lussier"
  ],
  "published": "2025-06-01T16:25:56+00:00",
  "fetched": "2025-06-01T22:08:38.043736+00:00",
  "text": "There’s a 104 days of summer vacation, but for some folks, school never really ends. At CCXP Mexico on Saturday, Prime Video unveiled its first look for season two of Gen V, the college-focused spinoff for The Boys, and the kids at Godolkin University have their work cut out for them.\n\nSet after The Boys’ fourth season amid Homelander effectively ruling the United States, complete with Godolkin students leaving campus through specific checkpoints and forced to wear ID badges, Marie (Jaz Sinclair) and her friends are released from a rehabilitation center and allowed back at school. There, the new dean Cipher (Hamish Linklater) is looking to get students battle ready for a potential Supes/Human war. While the regular Supe kids are content to prepare and party, there’s division among Marie and her friends: some want to run and never look back, others want to stay and tear things apart from the inside. Too bad for them, those plans are interrupted by the discovery of a secret program from the school’s early days which may somehow link to Marie.\n\nShortly before production on the new season began in spring 2024, Chance Perdromo (who played Andre, one of the kids imprisoned with Marie) died in a motorcycle crash. The Gen V team later stated they wouldn’t recast Andre and instead tweaked the season around his passing, and his father Polarity (Sean Patrick Thomas) will be mourning (and later investigating) Andre’s passing.\n\nAlso starring Derek Luh, Lizzie Broadway, London Thor, and Asa Germann, season two of Gen V kicks off September 17 with a three-episode premiere, followed by a single episode every week through October 22."
}