{
  "id": "60586d20cf0009c826ccc8af56f600e1",
  "url": "https://gizmodo.com/stop-using-start-itching-fda-flags-risk-tied-to-popular-allergy-meds-2000609359",
  "title": "Stop Using, Start Itching: FDA Flags Risk Tied to Popular Allergy Med Zyrtec",
  "category": "tech",
  "authors": [
    "Ed Cara",
    "Margherita Bassi",
    "Adam Kovac",
    "Lucas Ropek"
  ],
  "published": "2025-06-01T14:00:03+00:00",
  "fetched": "2025-06-01T16:52:15.489514+00:00",
  "text": "Two common anti-allergy medications can leave you feeling scratchier than ever. The Food and Drug Administration is warning that stopping long-term use of cetirizine and levocetirizine can, in rare cases, cause intense itchiness.\n\nThe FDA issued its warning earlier this month. Over the past decade, the agency has received hundreds of reports of people experiencing severe—sometimes “debilitating”—itching after going off the medications. Though it appears to be a rare complication, the FDA is also requiring manufacturers to mention the side effect in the labeling of these drugs.\n\n“The underlying mechanism for this risk is unknown, but our evaluation supports a causal relationship between stopping cetirizine or levocetirizine and pruritus,” the FDA stated in its Drug Safety Communication about the products.\n\nCetirizine and levocetirizine are both antihistamine drugs that have been around for a while. The former was first approved as the prescription drug Zyrtec in 1995, while levocetirizine was approved as Xyzal in 2007. Though the drugs can still be prescribed, they’re also now widely available over-the-counter to treat hay fever and other allergy symptoms.\n\nAs useful and safe as these drugs have been for millions of people, whispers of this side effect have been circulating for years. A 2019 study identified potential cases of severe pruritus (itching) related to cetirizine withdrawal dating back to at least 2008, for instance, while a 2016 study reported similar cases in the Netherlands tied to levocetirizine; users have also detailed their unbearable experiences trying to quit these drugs on Reddit and other social media platforms long before the FDA stepped in. While it’s possible some people may have had a return of allergy symptoms once they stopped taking these drugs, people commonly reported itching that hadn’t existed before or to a degree previously never experienced.\n\nThe FDA identified 209 cases worldwide (197 in the U.S.) of new-onset pruritus after cetirizine/levocetirizine withdrawal between April 2017 and July 2023. Most people had taken the medications for over three months, often years, though cases could also occur after only one month of continuous use. Sufferers typically complained of widespread itching that required medical intervention; in some cases, the itching was so severe that it left people bedridden or even led to thoughts of suicide or self-harm.\n\nThe silver lining is that this side effect seems to be rare overall. The FDA notes that about 100 million prescriptions or OTC purchases of both drugs combined were made in 2022. People with the side effect aren’t necessarily doomed to itch forever, either. The FDA found that 90% of people who restarted their medication resolved their itching, for instance, and about one-third of people were able to avoid a new bout of itching if they slowly weaned off the drug once restarting. Some people have also reported relief after taking a short course of corticosteroids.\n\nStill, if you’re a longtime user of these drugs, this is certainly something to be aware of in case you ever decide to stop. People planning to take these drugs long term should also discuss the benefits and risks of doing so with their doctor, the FDA said, “who can provide advice based on your personal needs.”"
}