{
  "id": "89763558477417120c910d7f9c0bb651",
  "url": "https://gizmodo.com/amazon-is-offloading-the-newest-lenovo-ideapad-15-512gb-win-11-pro-now-73-off-and-practically-free-2000609803",
  "title": "Amazon Is Offloading the Newest Lenovo Ideapad (15″, 512GB, Win 11 Pro), Now 73% Off and Practically Free",
  "category": "tech",
  "authors": [
    "Gizmodo Deals"
  ],
  "published": "2025-06-01T13:10:04+00:00",
  "fetched": "2025-06-01T16:52:17.003166+00:00",
  "text": "For students and those who live on a small budget, shelling out $1,000 (or even $2,000) for a MacBook is an out-of-reach dream. Fortunately, this year’s market offers a great alternative without having you compromise on performance or features: The Lenovo Ideapad, which was released this year, is currently available on Amazon for a price so cheap it’s not thought to be true.\n\nFor an insane 73% discount, the 15-inch portable touchscreen computer (16GB RAM, 512GB storage) is on sale for $519, down from its regular price of $1,899. This isn’t a sale, it’s a clearance and Amazon seems to be clearing out its stock with a deal that makes this Windows 11 Pro laptop one of the best deals going.\n\nSee at Amazon\n\nGreat Portable Laptop in 2025\n\nThe Lenovo Ideapad in question is a touchscreen 15.6-inch machine, so it’s perfect for work and play. Its Full HD (1920×1080) IPS display offers an anti-glare, clear view at 300 nits brightness which makes it easy to see comfortably in a bright room or outdoors. The inclusion of a responsive touch screen is the icing on the cake and makes easy navigation and instant availability of apps and features possible.\n\nUnder the hood, this laptop is powered by a 12th-generation Intel Core i5-1235U processor with 10 cores (2 performance and 8 efficiency) and 12 threads which has up to 4.4GHz available on the performance cores and 3.3GHz on the efficiency cores. With the setup, this 2025 Ideapad can easily handle demanding tasks such as multitasking with many browser windows open or using creative tools or even light gaming.\n\nMemory and storage are two areas where this Ideapad is great, especially for its price point. With 16GB of DDR4 RAM, you’ll enjoy smooth performance whether you’re editing documents, streaming videos, or switching between applications. The 512GB PCIe NVMe SSD provides ample space for all your files, while also ensuring fast boot times and quick access to your data. There is also a useful selection of ports: a USB 2.0, a USB 3.2 Gen 1, a USB-C 3.2 Gen 1 (data transfer), an HDMI 1.4b port, a headphone/microphone combo port, a card reader, and a charging connector.\n\nLenovo Ideapad comes with Windows 11 Professional in S mode which gives a safe and optimized experience right from the box. You can turn off the S mode if you require access to additional apps beyond the Microsoft Store.\n\nWith Amazon’s current promotion, you’re getting a laptop that would normally cost nearly four times as much: make sure you get yours before it runs out of stock!\n\nSee at Amazon"
}