{
  "id": "928c0618232787e7fccd64a45056238d",
  "url": "https://gizmodo.com/skip-the-hair-salon-this-amazing-dyson-hair-dryer-is-being-sold-at-a-loss-by-amazon-2000609799",
  "title": "Skip the Hair Salon, This Amazing Dyson Hair Dryer Is Being Sold at a Loss by Amazon",
  "category": "tech",
  "authors": [
    "Gizmodo Deals"
  ],
  "published": "2025-06-01T12:40:02+00:00",
  "fetched": "2025-06-01T16:52:18.601286+00:00",
  "text": "In the hair industry, not many companies get the respect Dyson has. Dyson is known for their vacuum expensive vacuum cleaners but they have also changed the hair dryer industry by creating salon-quality styling from home. Their latest creation, the Dyson Supersonic hair dryer, is the perfect example of their innovation.\n\nAmazon currently has a record low price for the Supersonic Nural hair dryer that you do not want to miss, and it’s probably making no profit on this device. This model usually retails for $499, but you can currently buy it for $399: That’ a rare 20% discount! Significant discounts do not normally happen on Dyson products, so when it does happen, you have to jump on it!\n\nSee at Amazon\n\nYour New Favorite Hair Dryer\n\nWhile traditional hair dryers use heavy bulky motors that are loud and clunky, the Supersonic model uses Dyson’s unique digital motor that is tiny, very powerful, and is very quiet. The motor is in the handle instead of the head, which makes the hair dryer more balanced and controlled. You will have a hair dryer that feels light, is ergonomically designed to fit comfortably in your hand and will not drain you during long periods of use.\n\nThere is more: it even has intelligent heat control when using the hair dryer. It has a built-in sensor that measures air temperature more than 40 times a second and it can help prevent heat damage and helps retain your hair’s natural shine. The hair dryer features Dyson’s Air Multiplier technology which generates a high-speed jet of air that dries hair in less time—and less frizz—while also smoothing strands to ensure you get that professional styling every time.\n\nOn top of that, the Supersonic dryer provides magnetic styling attachments from gentle air (for relaxed or tender scalps), to styling concentrator (to focus on specific areas), to a diffuser (for curly hairs). Each attachment is easy to trade out and is designed for both usability and efficiency. The Supersonic is also made to keep the user comfortable: Thanks to the engineering of the sound profile, you can dry and style your hair at any time of the day and not disturb anyone else!\n\nDyson hair dryers are utilized by some of the best salons in the world and that speak for itself. Bringing that kind of luxury and performance into your home is a huge advantage, and because it is only $379 right now, you should definitely not miss it.\n\nSee at Amazon"
}