{
  "id": "9f0420933ca47c2f5b4eedb1bf206261",
  "url": "https://gizmodo.com/28-years-later-is-bringing-new-scarier-infected-to-the-party-2000609771",
  "title": "’28 Years Later’ is Bringing New, Scarier Infected to the Party",
  "category": "tech",
  "authors": [
    "Justin Carter",
    "Gordon Jackson",
    "Germain Lussier",
    "Cheryl Eddy"
  ],
  "published": "2025-06-01T14:30:15+00:00",
  "fetched": "2025-06-01T16:52:14.705559+00:00",
  "text": "Sony’s 28 Years Later isn’t just reintroducing audiences to the series’ devastating post-apocalypse, it’s also bringing some new horrors along for the ride.\n\nIn an interview with IGN, director Danny Boyle teased the Infected have gained some new tricks since their last sighting in 28 Weeks Later. Along with the typical, fast-running ones that’ve been all over the marketing, some have “mutated” to survive in this new environment. Hence, the “Slow-lows,” so named because they “hang about low level” and don’t do running of any sort. Despite their lack of speed Boyle “[doesn’t] advise messing with them.”\n\nIf you’ve played video games with zombies, you know it’s never just one variant lurking around. Along with the Slow-lows, 28 Years Later will introduce Beserker and Alpha types which are stronger than the regular Infected and might have some intelligence buried within their Rage Virus-addled minds. On a technical level, Boyle said the team generally shot the Infected “in a brittle, almost unreliable way” similar to how they handled the first film. But the new undead get some additional flourishes, like Slow-low actors have cameras attached to them to enhance audience fear, or some sequences with specific Infected requiring 20 iPhones to simultaneously record in order to create “a poor man’s bullet time.”\n\nThe new Infected also lend themselves to 28 Years’ photography. For you format sickos, Boyle also told IGN the film was shot on widescreen to replicate the first movie’s “unease…the speed and the velocity, the visceral [aspect] of the way the infected were depicted. If you’re on a widescreen format, they could be anywhere… you have to keep scanning, looking around for them, really.”\n\n28 Years Later hits theaters on June 20."
}