{
  "id": "a87058cdea06ebd21854db5e00b69279",
  "url": "https://gizmodo.com/multiversus-shows-the-limits-of-ip-crossover-bonanzas-2000609542",
  "title": "‘MultiVersus’ Shows the Limits of IP Crossover Bonanzas",
  "category": "tech",
  "authors": [
    "Justin Carter",
    "James Whitbrook",
    "Sabina Graves"
  ],
  "published": "2025-06-01T17:45:16+00:00",
  "fetched": "2025-06-01T22:08:36.277183+00:00",
  "text": "This weekend marks the end of a short, but strange era: MultiVersus, a platform fighter featuring a bunch of Warner Bros. characters, has shut down. The game was intended as a hopeful rival to Super Smash Bros., and after a promising start, WB has cut bait about a year after its full relaunch.\n\nThat MultiVersus died isn’t really a surprise these days; the mid-2020s have featured a wave of multiplayer games being shut down or losing support not long after they launch. Babylon’s Fall, Crossfire X, Gundam Evolution, and WB’s own Suicide Squad: Kill the Justice League are just a handful of examples. But depending on who you ask, Player First’s platform fighter had plenty of fingers to blame for its end. Some attribute it to the full game’s monetization, others the difference in how it played between its year-long open beta and its 1.0 release in 2024.\n\nSome think it all boiled down to the roster; WB owns a lot of IP, and clearly the aim was to get a selection of characters that would appeal to everyone. But that broadness means for every general A-lister like Batman or LeBron James (seriously), you’ve got what could generously be considered B or C-listers in Gremlins and supporting Adventure Time characters. To those who’ve grown up with fighting games, Player First did the game a disservice without any other DC heavy hitters (your Flashes, Robins, etc.) or Cartoon Network kings like Ben 10, Gumball, and Dexter. There’s a certain degree of truth there—no doubt people would’ve paid to become teenage Ben 10, shift to Rath and subsequently pummel Superman into the pavement—but the bigger problem is the core concept of Multiversus is no longer special.\n\nWhen crossovers first happened between IP, it tended to feel like a genuine surprise to see characters from different worlds hang out. Those born in the 90s probably have a special place in their heart for the likes of Jimmy/Timmy Power Hour, Kim Possible teaming with Lilo & Stitch and Billy and Mandy getting mixed up with the Kids Next Door. The best thing working in their favor was how rare they felt: Jimmy/Timmy was an annualized trilogy, but these otherwise came and went before the shows got back to what they normally did. In the 2020s, that’s not really the case, as studios like WB and Disney want these meetings of the media to always feel big, attention-grabbing events that the surprise is lost. Of course WB wants to bring the IP it owns together, it spent about half of Space Jam: A New Legacy stating as such with the subtlety of a Rick & Morty episode piledriving a bit into the ground.\n\nBefore and during MultiVersus’ life, we’ve seen Batman and Marvel cross over with Fortnite, horror movie characters enter Mortal Kombat, hunt monsters as Aloy and Geralt of Rivia, and gotten into street fights as the Teenage Mutant Ninja Turtles and Overwatch heroes. The last two Call of Duty games have added the Turtles, Squid Game soldiers, WWE stars, and Paul Atreides are post-launch DLC for players to pay money for. Many have, but there’s an equal amount of players who think the increasing array of IP skins borders on excessive and at worse, worsens the game. Activision’s reportedly taking a more restrained approach going forward, but suffice to say, players aren’t exactly hard up to see their favorite characters kill one another.\n\nLike Suicide Squad before it, MultiVersus was ultimately a victim of WB chasing and trying to force its way into a space in the hopes of making money. It’s a shame Player First took the biggest hit of all—following the game’s full launch, WB subsequently bought the studio, and it’s now closed alongside its game. Meanwhile, crossovers still persist: DC is about to let some of its characters hang out with Marvel for the first time in 20 years, and Netherrealm will likely get some IP characters for its next project, which many are certain will be Injustice 3. In the same way the number must go up, the crossovers will persist until there’s no more worlds to collide."
}