{
  "id": "aec45188e156bc7cd96ed39532585a7c",
  "url": "https://gizmodo.com/this-jbl-xtreme-4-portable-speaker-hits-a-new-record-low-amazon-clears-out-stock-ahead-of-prime-day-2000609794",
  "title": "This JBL Xtreme 4 Portable Speaker Hits a New Record Low, Amazon Clears Out Stock Ahead of Prime Day",
  "category": "tech",
  "authors": [
    "Gizmodo Deals"
  ],
  "published": "2025-06-01T12:10:28+00:00",
  "fetched": "2025-06-01T16:52:19.609012+00:00",
  "text": "There’s nothing quite like having a great portable (Bluetooth) speaker to bring music to life during summer adventures – whether you’re at the beach, by the pool or hosting a backyard party. The JBL Xtreme 4 is one of the best speakers on the market for exactly this kind of experience. Launched last year as JBL’s latest premium portable speaker, it’s now available at an all-time low price, which makes it more accessible than ever before.\n\nIn fact, this is the first time ever that the JBL Xtreme 4 has dropped to such an attractive price point to just $249 which a massive 34% off its original $379 list price. Make sure you grab yours as soon as you can, because it might run out of stock very quickly.\n\nSee at Amazon\n\nBest Portable Speaker in 2025\n\nThe JBL Xtreme 4 is for the demanding listener that requires sound. The Xtreme 4 features exceptional sound performance created with two woofers, two powerful drivers, and dual JBL Bass Radiators. Whether you’re listening to your favorite playlist or setting the mood for a gathering, the Xtreme 4 ensures your music sounds rich and full, no matter where you are. The speaker’s advanced AI Sound Boost technology takes things a step further by analyzing the incoming audio signal in real time and using smart algorithms to optimize the speaker’s performance.\n\nYou will also love the battery life: The JBL Xtreme 4 has a play time of up to 24 hours on a single charge, which gives you the ability to jam to music all day and into the night without worrying about charging. If you want to jam to even more jams, the Playtime Boost feature offers an extra 6 hours of play time which is perfect for the overnight outing and multiple-day outdoor adventures. The built-in bottle opener option is great too – keep the BBQ and party practical and fun with ease!\n\nObviously, the speaker is also waterproof and dust-proof with an IP67 rating, which means it can withstand in nearly all environments while being able to splash around or get sandy while at the pool, beach, or picnic at the park. You can also rinse it off under running water if it gets splashed or sandy. The rugged design of JBL means it can handle travelling in the overseas adventure while active and outdoors.\n\nThis is an exceptional deal on one of the most impressive portable speakers, don’t miss it.\n\nSee at Amazon"
}