{
  "id": "b3ff6bf2108d20e0c91d6d01be5dd4a9",
  "url": "https://futurism.com/ai-relationship-emotional-cheating",
  "title": "Hanky Panky With Naughty AI Still Counts as Cheating, Therapist Says",
  "category": "tech",
  "authors": [],
  "published": "",
  "fetched": "2025-06-01T16:52:04.495716+00:00",
  "text": "Sexual relationships with AI chatbots have become all too common — but for some real-life partners, it still feels like cheating when it's happening behind their back.\n\nThat's the takeaway from a recent HuffPost column in which Marisa Cohen, a licensed marriage and family therapist, affirmed that having intimate encounters with anyone — or anything — without your partner's consent is damaging to the relationship, point-blank.\n\nThe piece was responding to a post on Reddit, which — though they're often anonymous and an exercise in creative fiction writing — served as an interesting jumping-off point to explore the ethics of the topic.\n\nIn the post, which has since been deleted but copied in part by HuffPost, a woman described her sense of betrayal when she walked in on her husband of 14 years having phone sex with a talking chatbot that was \"very tailored to his desires.\"\n\n\"It felt like a knife went through me,\" the OP wrote, \"and I couldn’t stop shaking.\"\n\nAn interesting wrinkle: the woman and her husband had agreed prior to tying the knot that \"emotional cheating\" was kosher as long as it wasn't physical. Still, the woman said she was \"stung\" that her hubby was having such sexual conversations with the chatbot \"almost every night\" — and even more so when he added that he talked to it for hours about non-sexual subjects too.\n\nWere he having those conversations with a human woman, that would technically be within the bounds of their relationship's rules. But for whatever reason, it seemed to bother the OP worse that her spouse was having his affair with a chatbot.\n\n\"I know he’s gonna say it’s not a big deal no matter what,\" she wrote, \"and I think this is what will upset me the most.\"\n\nDoes the woman have a right to be upset? It depends on the nitty-gritty of her interpretation of her agreement with her husband, which is why ongoing communication is a staple of successful open relationships.\n\nThat's important, because as Cohen points out, the situation represents a gray area. Is phone sex with an AI crossing the line into the \"physical intimacy\" with outside partners that they left off the table? It's a head-scratcher, and different reasonable people may well come to different conclusions.\n\n\"What one partner views as engaging with AI in a completely acceptable way, another may view as cheating,\" the therapist told HuffPost. \"This is something that must be discussed, so that both partners are aware of how the other feels.\"\n\n\"People that are involved in emotional cheating are sharing experiences with another (in this case AI) at the expense of sharing these moments, memories, or insights with their partners,\" Cohen said. \"This can create a distance between partners.\"\n\nIt's also worth noting that when they first married, there was no way the woman could have expected the \"emotional cheating\" clause in her relationship — one that sounds pretty suspicious, or at least like a slippery slope — to include an AI chatbot, because such technology was neither widespread nor sophisticated at the time. And even if she had, those boundaries can change — as the OP noted, she'd also been upset when finding out her husband had been whacking it to porn earlier in their marriage.\n\n\"It is important that both partners want to work on their relationship and that the emotional affair is acknowledged and ended,\" Cohen told HuffPost. \"This becomes more complicated in this case, as the partners may have different beliefs as to whether cheating has occurred.\"\n\nMore on chatbot relationships: Women With Body Image Issues Are Asking ChatGPT Something Terrible"
}