{
  "id": "c3f00543c6fe224e2edb8a97891d88d2",
  "url": "https://futurism.com/robot-ai-heart-rate-sweat",
  "title": "New AI Startup Giving Robots Virtual Heart Rate, Body Temperature, Sweating Response So They Can Better Emulate Human Emotions Like Fear and Anxiety",
  "category": "tech",
  "authors": [],
  "published": "",
  "fetched": "2025-06-01T16:52:04.100423+00:00",
  "text": "A teen tech entrepreneur is working to retrofit robots with simulated artificial bodily functions like a virtual heart rate, body temperature, and sweating response — a bong-rip idea to make them better emulate human emotional states like joy or anxiety.\n\nIn an interview with TechCrunch, the 19-year-old founder of \"emotionally intelligent robots\" company Intempus, Teddy Warner, explained why he's imbuing AI with digital versions of the often-uncomfortable sensations you feel during spells of heightened emotion like fear and anxiety.\n\nWarner told the website that he got the idea for his company while working at the AI image generator outfit Midjourney.\n\nDuring his time at that company, the researcher and his coworkers were tasked with building out a so-called \"world AI\" model, which essentially means an AI that makes decisions like humans do in the real world.\n\nWhile world models have made waves in the AI industry in recent years, they've fallen short because, as Warner puts it, they're being trained on data from robots that heretofore have lacked the kind of physiological feedback humans have.\n\n\"Robots currently go from A to C, that is observation to action, whereas humans, and all living things, have this intermediary B step that we call physiological state,\" he explained to TechCrunch. \"Robots don’t have physiological state. They don’t have fun, they don’t have stress.\"\n\nFor robots to understand our human world, they need \"be able to communicate with humans in a way that is innate to us, that is less uncanny, more predictable, we have to give them this B step,\" he continued.\n\nIn short, Warner thinks robots need to be able to feel like we feel. After hooking himself and his buddies up to polygraph tests to capture their sweat data, the youthful founder built out an AI model that can, as he told the website, \"essentially allow robots to have an emotional composition\" based on lie detector data.\n\nDepending on how much Kool-Aid you've had to drink, the concept of feeling robots — and AI trained on lie detector tests — is either goofy or terrifying. The latter vibe is worsened by Warner's recent announcement that he'd won a Thiel Fellowship, which the controversial tech billionaire Peter Thiel awards to several youngsters each year to fund their entrepreneurial dreams.\n\nSince September, Warner has built out the Intempus research apparatus and managed to sign seven partners in the process. He's now hiring staffers and working on testing his retrofitted feeling robots in front of customers — though he says he's not opposed to building his own robots in the future.\n\n\"I have a bunch of robots, and they run a bunch of emotions,\" he told TechCrunch. \"I want to have someone come in and just understand that this robot is a joyful robot, and if I can innately convey some emotion, some intents that the robot holds, then I’ve done my job properly.\"\n\nMore on robots: Thailand Deploys Humanoid Robot Dressed in Police Uniform"
}