{
  "category": "space",
  "id": "0a70603f1812f0f98fdc12d1e6aa54b1",
  "url": "https://www.space.com/astronomy/one-of-the-most-geometrically-perfect-what-is-this-mysterious-sphere-deep-in-the-milky-way-galaxy",
  "title": "'One of the most geometrically perfect': What is this mysterious sphere deep in the Milky Way galaxy?",
  "text": "There's no shortage of round celestial objects in our universe. Planets, moons and stars all exhibit lovely spherical shapes. But astronomers recently spotted a mysteriously circular orb deep in the Milky Way galaxy — and it's certainly none of these things.\n\nThis celestial bubble, discovered by astrophysicist Miroslav Filipović of Western Sydney University, is likely a supernova remnant (SNR), an expanding shell of gas and dust formed by shockwaves from a massive stellar explosion. SNRs aren't uncommon, but this particular example showcases numerous anomalies, including its astonishingly round shape. For that shape, Filipović and his team named SNR Teleios, the Greek word for \"perfect.\"\n\nFilipović discovered Teleios — officially designated G305.4–2.2 — by accident, scanning through new images taken by the radio telescope Australian Square Kilometre Array Pathfinder (ASKAP). ASKAP is currently surveying the entire southern hemisphere sky. \"I was looking at these images as they became available, searching for anything interesting, or not seen before, and came across Teleios,\" Filipović told Space.com. \"Its perfectly circular shape was unusual, and so I investigated further.\"\n\nUsing data from ASKAP and the Murchison Widefield Array, Filipović and his team estimate that Teleios spans either about 46 light-years across at a distance of about 7,175 light-years from Earth, or about 157 light-years across at a distance of about 25,114 light-years from Earth. (Judging such vast distances in space is difficult.) Regardless of the size and distance of Teleios, though, the SNR's near-perfect symmetry is extraordinary. Its shape was quantified with a circularity score of 95.4%, placing it among the most symmetric known SNRs.\n\nWhile idealized models suggest SNRs remnants should be circular, reality often paints a more chaotic picture. \"'Typical' SNR shapes vary dramatically, either from asymmetries in the initial explosion, or disruption from expanding into a non-perfect environment, or a number of other interfering factors,\" says Filipović. \"What makes Teleios' shape so remarkable is that it displays none of these asymmetries; it effectively looks like an explosion that has happened with almost perfect initial parameters and with almost no disruption while expanding.\"\n\nSo, what could explain such an undisturbed evolution? According to Filipović, it likely comes down to location. Teleios lies 2.2 degrees below the Galactic Plane, where interstellar gas and dust are significantly more sparse. This environment may have allowed the remnant to expand while remaining largely undisturbed for thousands of years.\n\nA diagram showing where Teleios is located in the context of the Galactic Plane. (Image credit: Filipović et al.)\n\nTeleios' shape is only one of the unusual characteristics of this SNR. Adding to the mystery, Teleios emits only in radio wavelengths, with a hint of hydrogen-alpha emissions. \"Most SNRs are visible at another frequency. They either emit at optical, infrared, or X-ray frequencies as well,\" says Filipović. \"The fact that we don't see that here is quite confusing. It could be that the temperatures are not high enough to produce this emission, or that Teleios is old enough that the optical emission has faded, but the radio emission is still present.\"\n\nGet the Space.com Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nThis lack of emissions poses challenges to determining the type of supernova that produced Teleios. The most likely scenario is a Type Ia supernova, which occurs in binary star systems in which a white dwarf consumes enough mass of its companion star to explode violently. Alternatively, Teleios' origin might be Type Iax supernova, which is similar to a Type Ia supernova but one that leaves behind a \"zombie\" star. But Teleios's observable data doesn't fit either model perfectly.\n\nAs it goes with newfound objects in the universe, researchers have a lot more to study to unravel all of Teleios's mysteries. Fortunately, there's no better time to study SNRs. \"These are the 'golden days' for radio astronomy as the new instruments, such as ASKAP and MeerKAT, are opening windows for new discoveries,\" says Filipović.",
  "authors": [
    "Stefanie Waldek",
    "Contributing Writer",
    "Social Links Navigation"
  ],
  "published": "2025-05-29T20:00:00+00:00",
  "fetched": "2025-05-29T21:55:26.056717+00:00"
}