{
  "category": "space",
  "id": "0b6aab8a248badf6fbe958366b5efac5",
  "url": "https://www.space.com/stargazing/see-a-lunar-scar-darken-the-crescent-moon-on-may-30",
  "title": "See a lunar scar darken the crescent moon on May 30",
  "text": "May 30 presents a perfect opportunity to spot Mare Crisium — a dark Nevada-sized patch — etched into the delicate curve of the crescent moon before it sinks below the horizon around midnight.\n\nSkywatchers in the U.S. will find the moon 's sickle-like form hanging around 30 degrees above the western horizon after sunset on May 30, with around 16% of its surface illuminated by direct sunlight, according to stargazing website in-the-sky.org . On May 30, the moon is in the constellation Cancer , with the Beehive cluster close to its left and Mars shining just beyond. To the right, the bright stars Castor and Pollux also make an appearance.\n\nThe moon is among the most popular targets for astronomers, thanks to the ever-shifting play of light and shadow across its surface. As it makes its near month-long journey around Earth, a myriad of different regions and features come into stark relief, changing night by night. And yet, for all this variety, the moon only ever shows a single side to us as it's tidally locked to our planet.\n\nOne such feature is the dark lunar maria (Latin for 'seas'), formed when molten lava flooded a network of impact basins that scarred the moon's surface billions of years ago. These lava flows swiftly cooled in the frigid environment of space , leaving behind vast basaltic plains that remain easily visible to the naked eye today.\n\nMare Crisium, or the 'Sea of Crises', can be spotted on the night of May 30 as an oval-shaped dark patch on the moon's northeastern limb, close to the terminator — the line that separates day from night on any solar system body.\n\nA simulation of the crescent moon showing the location of Mare Crisium. (Image credit: Chris Vaughan/Starry Night)\n\nSpanning 345 miles (555 kilometers), this lunar mare is visible to the naked eye, though a pair of 10x50 binoculars will reveal more of the craggy region surrounding the lunar sea. An entry-level 6-inch telescope, meanwhile, will allow you to pick out the 14-mile-wide (23 km) Picard Crater that stands alone near the south-western rim of the Nevada-sized plane, according to NASA . Just above Picard lies the similarly sized Peirce Crater, with the smaller Swift Crater just beyond.\n\nBefore the moon dips below the western horizon around midnight local time, moongazers may also catch sight of its shadowed expanse faintly glowing — an effect known as earthshine, caused by sunlight reflected off Earth softly illuminating the moon's night side.\n\nGet the Space.com Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nAn annotated image of Mare Crisium showing the locations of Picard Crater, with Peirce Crater and Swift Crater above. (Image credit: NASA/GSFC/ASU)\n\nTOP TELESCOPE PICK: (Image credit: Amazon) Want to explore the lunar surface for yourself? The Celestron NexStar 4SE is ideal for beginners wanting quality, reliable and quick views of celestial objects. For a more in-depth look at our Celestron NexStar 4SE review.\n\nThe closest humans have come to Mare Crisium was during the final moon mission of the Apollo era, when Apollo 17 astronauts Eugene Cernan, Ron Evans and Harrison \"Jack\" Schmitt landed on the eastern edge of Mare Serenitatis. However, Mare Crisium did serve as the landing site of the Soviet Luna 15 and Luna 24 robotic missions, and it made headlines again in March 2025 with the successful touchdown of Firefly Aerospace's Blue Ghost lander.\n\nAnyone interested in exploring the lunar surface for themselves should check out our guides to the best binocular and telescope deals available in 2025. Also, be sure to read up on our guide to photographing and exploring the moon's surface .\n\nEditor's Note: If you would like to share your astrophotography with Space.com's readers, then please send your photo(s), comments, and your name and location to spacephotos@space.com.",
  "authors": [
    "Anthony Wood",
    "Skywatching Writer"
  ],
  "published": "2025-05-29T18:00:00+00:00",
  "fetched": "2025-05-29T21:55:27.274219+00:00"
}