{
  "category": "space",
  "id": "0bf2c2815e9dc13ddd0ed0579c63fd5f",
  "url": "https://www.space.com/space-exploration/launches-spacecraft/spacex-aiming-for-record-breaking-170-orbital-launches-in-2025",
  "title": "SpaceX aiming for record-breaking 170 orbital launches in 2025",
  "text": "A SpaceX Falcon 9 rocket carrying Starlink satellites lifts off from NASA's Kennedy Space Center in Florida on Dec. 31, 2024, marking the company's 134th and last launch of the year.\n\nSpaceX will end up launching an orbital mission nearly every other day in 2025, if all goes according to plan.\n\n\"We're targeting 170 launches by the end of the year,\" Anne Mason, director of national security space launch at SpaceX, said during a call with reporters on Wednesday (May 28).\n\nThat would shatter the company's single-year record of 134 orbital liftoffs, which was set just last year.\n\n\"I always find it amazing that this cadence has become somewhat normal,\" Mason added during Wednesday's call, which served to preview SpaceX's planned Friday (May 30) launch of the GPS III SV08 satellite for the U.S. Space Force.\n\n\"But if we look back just five years ago, in 2020 when we launched roughly 25 times, which is still a healthy rate at twice a month, and now launching on average every two to three days — I think this demonstrates how Falcon's reusability and reliability, plus the hard work and dedication of the SpaceX team, has been critical to supporting assured access to space,\" she said.\n\nSpaceX's workhorse Falcon 9 rocket performed 132 of last year's orbital liftoffs. The other two came courtesy of the company's powerful Falcon Heavy. Both Falcons feature reusable first stages — three of them in the Heavy's case — which is a big factor in SpaceX's impressive launch cadence, as Mason noted.\n\nThe upper stages of both Falcons are expendable, but SpaceX has gotten very good at churning out that complicated piece of hardware.\n\nGet the Space.com Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\n\"We have a second stage coming off the production line every two and a half days,\" Mason said.\n\nAbout two-thirds of last year's orbital launches were dedicated to building out SpaceX's Starlink broadband constellation in low Earth orbit. Starlink is the largest satellite network ever assembled; it consists of more than 7,500 active spacecraft at the moment.\n\nStarlink is also growing all the time, as this year's statistics show: SpaceX has launched 64 orbital missions so far in 2025 (all of them with the Falcon 9), and 48 of them have been Starlink flights.\n\nThat works out to a rate of 0.43 launches per day. This means SpaceX will have to pick up the pace a bit to reach the target Mason mentioned: 170 launches in one year would equal about 0.47 launches per day.\n\nThese numbers refer only to orbital launches, so they don't count the suborbital test flights of Starship, the megarocket SpaceX is developing to help humanity colonize Mars. The company launched four Starship test flights in 2024 and has conducted three so far this year, most recently on Tuesday (May 27).",
  "authors": [
    "Mike Wall",
    "Senior Space Writer",
    "Social Links Navigation"
  ],
  "published": "2025-05-29T19:00:00+00:00",
  "fetched": "2025-05-29T21:55:26.678874+00:00"
}