{
  "id": "0dcba93be211e20e810da367eb36b462",
  "url": "https://www.unite.ai/creatify-raises-15-5m-series-a-redefines-video-advertising-with-ai/",
  "title": "Creatify Raises $15.5M Series A, Redefines Video Advertising with AI",
  "category": "autonomous",
  "authors": [
    "Antoine Tardif"
  ],
  "published": "2025-05-28T20:54:16+00:00",
  "fetched": "2025-05-30T12:53:56.178496+00:00",
  "text": "Creatify, the AI platform reshaping the video advertising landscape, has raised $15.5 million in Series A funding, co-led by WndrCo and Kindred Ventures. This latest round brings the company’s total funding to $23 million, with backing from early investors including NFDG, Millennium New Horizons, Creator Ventures, and Leadout Capital. In just 18 months since its launch, Creatify has achieved an impressive $9 million in annual recurring revenue (ARR), demonstrating the growing demand for its platform.\n\nCreatify has become the go-to platform for marketers looking to streamline video ad creation, testing, and optimization. With over 1.5 million marketers and 10,000+ teams using the platform, Creatify is trusted by global brands such as Alibaba.com, Comcast, Binance, and Zumper. By harnessing the power of generative AI, Creatify’s platform automates the entire video ad lifecycle, making it faster and more cost-effective for brands to create high-performance video ads.\n\nThe company was founded by Yinan Na, Ledell Wu, and Xin Zhou, all former tech leaders with extensive experience at Meta and Snap. Together, they’ve developed an AI-driven solution to solve the challenges of traditional video ad production, making high-quality video ads accessible to businesses of all sizes.\n\nAdMax: A New Era in Video Ad Creation\n\nCreatify’s newly raised funds will support the launch of AdMax, the company’s boldest step forward in redefining video advertising. AdMax is an end-to-end AI-powered advertising agent that automates creative inspiration, production, testing, and performance optimization—all within one platform.\n\nKey features of AdMax include:\n\nAd Monitoring : Turns top competitor and category ads into actionable campaigns.\n\n: Turns top competitor and category ads into actionable campaigns. AI-Powered Video Generation : Creates dozens of UGC-style and product showcase videos in minutes.\n\n: Creates dozens of UGC-style and product showcase videos in minutes. 700+ AI-Generated Avatars : Enables multilingual, cross-platform video production without the traditional costs.\n\n: Enables multilingual, cross-platform video production without the traditional costs. Creative Testing Engine : Optimized for platforms like Meta and TikTok, designed to maximize ROAS (Return on Ad Spend) and CPA (Cost Per Acquisition).\n\n: Optimized for platforms like Meta and TikTok, designed to maximize ROAS (Return on Ad Spend) and CPA (Cost Per Acquisition). API Access & Team Workspaces: Streamlines video production at scale while maintaining brand consistency.\n\nAccording to Jeffrey Katzenberg, co-founder of DreamWorks and Founding Partner at WndrCo, who will join Creatify’s board, “Creatify is not just making video ads easier to produce; it’s redefining how modern advertising works. In a world where brands must be present everywhere, all the time, Creatify is purpose-built to meet that demand at scale.”\n\nTransforming the Advertising Landscape\n\nThe impact of Creatify’s platform is already clear. Zumper now produces over 300 videos per month, saving $20,000 in the process. NewsBreak has dramatically reduced creative production time, launching tailored creatives in minutes rather than days, while improving performance across different audience segments.\n\nJames Borow, Vice President of Product and Engineering at Comcast, shared, “Creatify is changing the game for TV advertising. By identifying key obstacles in ad creation, Creatify is making TV advertising accessible to brands of all sizes.”\n\nRyan Ludlow, General Manager at NewsBreak, added, “Creatify’s Ad Creation tool removes creative roadblocks, giving advertisers the ability to produce high-quality video creatives quickly. It’s been a game-changer for our most successful advertisers, allowing them to scale efficiently.”\n\nA Vision to Scale Advertising with AI\n\nGenerative AI is revolutionizing the advertising industry by automating and streamlining video ad production. What once required specialized teams and lengthy production cycles can now be achieved quickly and cost-effectively. AI models like Creatify’s AdMax analyze performance data and generate tailored content, enhancing creativity while optimizing for maximum impact.\n\nOne of the key advantages of generative AI is its ability to scale campaigns across multiple platforms with minimal effort, enabling businesses to reach diverse global audiences without compromising brand consistency. This is especially crucial as brands strive to connect with consumers worldwide in an increasingly digital landscape.\n\nBy automating the ad creation process, generative AI frees marketers to focus on strategy and innovation. It allows for faster, smarter decision-making and more personalized ad experiences, leveling the playing field for brands of all sizes.\n\nWhat’s Next for Creatify?\n\nWith the Series A funding, Creatify will accelerate its efforts to expand its platform and enhance customer success. The company is focused on improving its AI capabilities and continuing to deliver value to its growing user base. Creatify is also actively hiring to support its expansion.\n\n“We’re excited to continue building tools that empower marketers to create smarter, more effective ads,” says Yinan Na. As the advertising industry continues to embrace AI-driven technologies, platforms like Creatify are well-positioned to contribute to the ongoing transformation of how video ads are created, tested, and optimized."
}