{
  "category": "autonomous",
  "id": "0e56ddfae3ecfb2c8b3daf91ccfb55f0",
  "url": "https://www.autonomousvehicleinternational.com/news/robotaxis/wsu-study-finds-emotional-responses-are-integral-to-peoples-attitudes-toward-self-driving-cars.html",
  "title": "WSU study finds emotional responses are integral to people’s attitudes toward self-driving cars",
  "text": "A new study from Washington State University (WSU) exploring public attitudes toward self-driving cars as the technology approaches commercial availability has found that feelings of excitement and pleasure, along with a belief in the technology’s social benefits, are just as important as understanding the technology itself in shaping public opinion.\n\nThe study, published in the journal Transportation Research, surveyed 323 people on their perceptions of autonomous vehicles.\n\nThe emotional value associated with self-driving cars\n\nResearchers found that considerations such as how much people understand and trust the cars are important. “But in addition, we found that some of the non-functional aspects of autonomous vehicles are also very important,” said Wei Peng, an assistant professor in the Edward R. Murrow College of Communication at WSU.\n\nThese included the emotional value associated with using the cars, such as feelings of excitement, enjoyment or novelty; beliefs about the broader impact on society; and curiosity about learning how the technology works and its potential role in the future, Peng said.\n\nThey also found that respondents would want to give the technology a test drive before adopting it. “This is not something where you watch the news and say, ‘I want to buy it or I want to use it.’ People want to try it first,” added Peng.\n\nThe new paper is the latest research on the subject from Peng and doctoral student Kathryn Robinson-Tay. In a paper published in 2023, they examined whether people believed the vehicles were safe, finding that simply knowing more about how the cars work did not improve perceptions about risk — people needed to have more trust in them, too.\n\nChanging attitudes toward self-driving cars\n\nThe future of autonomous vehicles depends on successfully motivating people to use them, says WSU. Already, car makers are adding autonomous features to models, and self-driving taxis have begun operating in a handful of US cities, such as Phoenix, San Francisco and Los Angeles. Fully self-driving vehicles could become available by 2035.\n\nIn a national survey by AAA released in February, 60% of respondents said they were afraid to use autonomous cars.\n\nAttitudes toward self-driving cars depend heavily on individual circumstances, and can be nuanced in surprising ways, WSU says. For example, the research found that those with a strong car-authority identity – a personal investment in driving and displaying knowledge about automobiles – and more knowledge about self-driving cars were more likely to believe the cars would be easy to use. But the research also found that respondents with more knowledge were less likely to view the cars as useful.\n\nOther considerations also play a role. Those who can’t drive due to disability or other reasons may have a stronger motivation to use them, as might drivers with significant concerns about heavy traffic or driving in inclement weather.\n\n“If I really worry about snowy weather, like we experience in Pullman in winter, is it going to help?” Peng said as an example. “If I really worry about weather, I might get a car like that if it would help me steer clear of dangerous weather conditions.”\n\nIt is estimated that autonomous vehicles could prevent 90% of accidents while improving mobility for people with limited access to transportation. However, achieving those benefits would require widespread, rapid adoption — WSU notes that this would be a big hurdle given that public attitudes toward the cars have been persistently negative and the rollout of robotaxis has been bumpy, with some high-profile accidents and recalls.\n\nFuture research\n\nWith the research revealing that respondents did not trust vehicles more because they found them easy to use, doctoral student Kathryn Robinson-Tay raised an important question for future research: “What is it about perceiving a car as easy to use that actually leads people to trust it less?”\n\nIn related news, Waymo recently released its latest research paper that shows the Waymo Driver is making significant strides in reducing severe crashes and improving the safety of those most at risk. Click here to read the full story",
  "authors": [
    "Zahra Awan",
    "Web Team"
  ],
  "published": "2025-05-29T14:25:03+00:00",
  "fetched": "2025-05-29T21:49:14.807831+00:00"
}